# St7NewCavityFluidLayout

Creates a new cavity fluid layout.

long St7NewCavityFluidLayout(long uID, long CavityID, char* LayoutName)

Input Parameters

uID

Strand7 model file ID.

Cavity Fluid

CavityID

Cavity fluid layout ID.

LayoutName

Name of the layout.